tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

brew "adr-tools"
brew "bat"
brew "bazel"
brew "bzip2"
brew "curl"
brew "emacs", link: false
brew "fzf"
brew "ghq"
brew "git"
brew "gnupg"
brew "go"
brew "haskell-stack"
brew "helm"
brew "iproute2mac"
brew "jenv"
brew "jq"
brew "krew"
brew "kube-ps1"
brew "kustomize"
brew "mas"
brew "nkf"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pinentry"
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "readline"
brew "ripgrep"
brew "saxon"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "tig"
brew "tree"
brew "wget"
brew "yq"
brew "zlib"
brew "zsh-completions"


cask "adoptopenjdk8"
cask "boostnote"
cask "box-sync"
cask "chef-workstation"
cask "chromedriver"
cask "docker"
cask "emacs"
cask "firefox"
cask "google-chrome"
cask "intellij-idea19" #TODO: checkout own branch
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "java8"
cask "jetbrains-toolbox"
cask "microsoft-auto-update"
cask "microsoft-office" #TODO: mas
cask "microsoft-teams"
cask "minecraft"
cask "slack" #TODO: mas
cask "sony-ps4-remote-play"
cask "vagrant"
cask "viber"
cask "virtualbox"
cask "zoom"


mas "LINE", id: 539883307
mas "Twitter", id: 1482454543
mas "final-cut-pro", id: 424389933
mas "kindle", id: 405399194
mas "logic-pro", id: 634148309
mas "microsoft-365", id: 1450038993
mas "tweetdeck-by-twitter", id: 485812721


## Archive
## brew "dhall"
## brew "dhall-json"
## brew "docker-compose" # bundled in docker for mac
## brew "kn"
## brew "kubectx"
## brew "opam"
## brew "telnet"
## brew "the_silver_searcher"
## cask "background-music"
## cask "latexit"
## cask "minikube"
## mas "Xcode", id: 497799835 # too heavy
## mas "slack", id: 803453959 # cask
